src/main/java/com/amdocs/halo/automation/xmls/VNF_MACD.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://CustomerOrderEstablishment.ocxGenericServices.services.amdocs.com"> 
   <soapenv:Header> 
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"> 
         <wsse:UsernameToken wsu:Id="UsernameToken-E9831C5131DB1C636214604451108501"> 
            <wsse:Username>OMS</wsse:Username> 
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Oms111</wsse:Password> 
            <!--wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">vAMoAVTyRHWrqnMzZjAWBw==</wsse:Nonce> 
            <wsu:Created>2016-04-12T07:11:50.847Z</wsu:Created--> 
         </wsse:UsernameToken> 
      </wsse:Security> 
   </soapenv:Header> 
   <soapenv:Body> 
      <cus:createProductOrderForExistingProduct> 
         <createProductOrderForExistingProductRequest> 
            <salesChannel>SS</salesChannel> 
            <options> 
               <confirmationChecksApproved>true</confirmationChecksApproved> 
            </options> 
            <order> 
 
               <userId>hs1650</userId> 
               <customer> 
                  <contractId>AT1706</contractId> 
                  <customerId>8390000001706</customerId> 
                  <customerName>AMDOCS1706</customerName> 
                  <customerType>CORP</customerType> 
                  <organizationId>123459006</organizationId> 
                  <saartId>ABCD1706</saartId> 
               </customer> 
               <description>COS Change</description> 
               <startOrderingProcess>false</startOrderingProcess> 
 
               <topLevelProducts> 
                  <associationSpec> 
                     <assignedProductId>{$assignProductId$}</assignedProductId> 
                  </associationSpec> 
                  <orderItem> 
                     <contacts> 
                        <city>TX</city> 
                        <contactType>CUS</contactType> 
                        <email>harmesh.saluja@amdocs.com</email> 
                        <firstName>Harmesh</firstName> 
                        <landLinePhone>123458</landLinePhone> 
                        <lastName>Saluja</lastName> 
                        <mobilePhone>9856987747</mobilePhone> 
                     </contacts> 
                     <orderActionType>CH</orderActionType> 
                     <serviceAdddress> 
                        <locationId>GLID001</locationId> 
                        <city>CHGO</city> 
                        <country>US</country> 
                        <houseNumber>554</houseNumber> 
                        <isoCountryCode>IL</isoCountryCode> 
                        <stateName>554</stateName> 
                        <state>IL</state> 
                        <streetName>Diversey</streetName> 
                        <zipCode>60614-11</zipCode> 
                        <clli8>CHCMILVWN00</clli8> 
                     </serviceAdddress> 
                     <serviceRequiredDate>2020-05-29T23:59:59+02:00</serviceRequiredDate> 
                  </orderItem> 
                  <topLevelProduct> 
                     <containedProducts> 
                        <action>CHANGE</action> 
                        <associationSpecDefinition> 
                           <componentServiceType>VNF</componentServiceType> 
                        </associationSpecDefinition> 
                        <characteristicValues> 
                           <characteristicDefinition> 
                              <attributeCode>TotalRC</attributeCode> 
                           </characteristicDefinition> 
                           <value>299.99</value> 
                        </characteristicValues> 
                     </containedProducts> 
                  </topLevelProduct> 
               </topLevelProducts> 
 
               <!--<topLevelProducts> 
                  <associationSpec> 
                     <assignedProductId>100458447</assignedProductId> 
                  </associationSpec> 
                  <orderItem> 
                     <contacts> 
                        <city>TX</city> 
                        <contactType>CUS</contactType> 
                        <email>harmesh.saluja@amdocs.com</email> 
                        <firstName>Harmesh</firstName> 
                        <landLinePhone>123458</landLinePhone> 
                        <lastName>Saluja</lastName> 
                        <mobilePhone>9856987747</mobilePhone> 
                     </contacts> 
                     <orderActionType>CH</orderActionType> 
                     <serviceAdddress> 
                        <locationId>GLID001</locationId> 
                        <city>CHGO</city> 
                        <country>US</country> 
                        <houseNumber>554</houseNumber> 
                        <isoCountryCode>IL</isoCountryCode> 
                        <stateName>554</stateName> 
                        <state>IL</state> 
                        <streetName>Diversey</streetName> 
                        <zipCode>60614-11</zipCode> 
                        <clli8>CHCMILVWN00</clli8> 
                     </serviceAdddress> 
                     <serviceRequiredDate>2020-05-29T23:59:59+02:00</serviceRequiredDate> 
                  </orderItem> 
                  <topLevelProduct> 
                     <containedProducts> 
                        <action>CHANGE</action> 
                        <associationSpecDefinition> 
                           <componentServiceType>PORT</componentServiceType> 
                        </associationSpecDefinition> 
                        <characteristicValues> 
                           <characteristicDefinition> 
                              <attributeCode>CIRSpeed</attributeCode> 
                           </characteristicDefinition> 
                           <value>150</value> 
                        </characteristicValues> 
                        <characteristicValues> 
                           <characteristicDefinition> 
                              <attributeCode>ClassofService</attributeCode> 
                           </characteristicDefinition> 
                           <value>25</value> 
                        </characteristicValues> 
                     </containedProducts> 
                  </topLevelProduct> 
               </topLevelProducts> 
--> 
 
            </order> 
         </createProductOrderForExistingProductRequest> 
      </cus:createProductOrderForExistingProduct> 
   </soapenv:Body> 
</soapenv:Envelope>